proglang/proglang.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Individual Programming Languages</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Individual Programming Languages"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-16 10:44:43 IDT"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content="Mayer Goldberg, programming languages, computing, history of computing, logic programming, functional programming, object-oriented programming, programming paradigms"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Individual Programming Languages</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Categories of programming languages</a>
<ul>
<li><a href="#sec-1-1">1.1 Functional (and semi-functional) languages</a></li>
<li><a href="#sec-1-2">1.2 Logic languages</a></li>
<li><a href="#sec-1-3">1.3 Array languages</a></li>
<li><a href="#sec-1-4">1.4 Database languages</a></li>
<li><a href="#sec-1-5">1.5 List-processing languages</a></li>
<li><a href="#sec-1-6">1.6 Languages for typesetting &amp; DTP</a></li>
<li><a href="#sec-1-7">1.7 Languages for symbolic computations</a></li>
<li><a href="#sec-1-8">1.8 Languages for numerical computations</a></li>
<li><a href="#sec-1-9">1.9 Languages for statistical computations</a></li>
<li><a href="#sec-1-10">1.10 Discrete simulation languages</a></li>
<li><a href="#sec-1-11">1.11 Scripting languages</a></li>
<li><a href="#sec-1-12">1.12 Threaded languages</a></li>
<li><a href="#sec-1-13">1.13 Algol-descendent languages</a></li>
<li><a href="#sec-1-14">1.14 Object-oriented languages</a></li>
<li><a href="#sec-1-15">1.15 Procedural languages</a></li>
<li><a href="#sec-1-16">1.16 Low-level languages</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Complete list of programming languages (with which I am at least somewhat familiar)</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Categories of programming languages</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Functional (and semi-functional) languages</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li><a href="#Erlang">Erlang</a>
</li>
<li><a href="#Haskell">Haskell</a>
</li>
<li><a href="#LISP">LISP</a>
</li>
<li><a href="#Miranda">Miranda</a>
</li>
<li><a href="./ml.html">ML</a>
</li>
<li><a href="#Nil">Nil</a>
</li>
<li><a href="./scheme.html">Scheme</a>
</li>
<li><a href="#T">T</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Logic languages</h3>
<div class="outline-text-3" id="text-1-2">


<ul>
<li><a href="#Prolog">Prolog</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Array languages</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="#APL">APL</a>
</li>
<li><a href="#J">J</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Database languages</h3>
<div class="outline-text-3" id="text-1-4">


<ul>
<li><a href="#SQL">SQL</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> List-processing languages</h3>
<div class="outline-text-3" id="text-1-5">


<ul>
<li><a href="#L6">L6</a>
</li>
<li><a href="#LISP">LISP</a>
</li>
<li><a href="./scheme.html">Scheme</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Languages for typesetting &amp; DTP</h3>
<div class="outline-text-3" id="text-1-6">


<ul>
<li><a href="#LaTeX">LaTeX</a>
</li>
<li><a href="#Postscript">Postscript</a>
</li>
<li><a href="#roff">roff</a>
</li>
<li><a href="#TeX">TeX</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Languages for symbolic computations</h3>
<div class="outline-text-3" id="text-1-7">

<ul>
<li>Macsyma
</li>
<li>Maple
</li>
<li>Mathematica
</li>
<li>Maxima
</li>
<li>Reduce
</li>
</ul>

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Languages for numerical computations</h3>
<div class="outline-text-3" id="text-1-8">


</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Languages for statistical computations</h3>
<div class="outline-text-3" id="text-1-9">


</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Discrete simulation languages</h3>
<div class="outline-text-3" id="text-1-10">


<ul>
<li>Simscript
</li>
<li>Simula
</li>
</ul>


</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Scripting languages</h3>
<div class="outline-text-3" id="text-1-11">


</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Threaded languages</h3>
<div class="outline-text-3" id="text-1-12">


<ul>
<li>Forth
</li>
<li>Postscript
</li>
</ul>


</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Algol-descendent languages</h3>
<div class="outline-text-3" id="text-1-13">


<ul>
<li><a href="#Algol-60">Algol 60</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> Object-oriented languages</h3>
<div class="outline-text-3" id="text-1-14">


<ul>
<li>C++
</li>
<li>Java
</li>
<li>Ruby
</li>
<li>Self
</li>
<li>Smalltalk
</li>
</ul>


</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> Procedural languages</h3>
<div class="outline-text-3" id="text-1-15">


</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> Low-level languages</h3>
<div class="outline-text-3" id="text-1-16">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Complete list of programming languages (with which I am at least somewhat familiar)</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><a name="Algol" class="target">Algol</a> 
<ul>
<li><a href="./algol60.html">Algol 60</a>
</li>
<li><a name="Algol-68" class="target">Algol 68</a> 
</li>
</ul>

</li>
<li><a name="APL" class="target">APL</a> 
</li>
<li><i>Assembly Languages</i>
<ul>
<li><i>Real architectures</i>
</li>
<li><i>Virtual architectures</i>
</li>
</ul>

</li>
<li><a name="B" class="target">B</a> 
</li>
<li><a name="Basic" class="target">Basic</a> 
</li>
<li><a name="bc" class="target">bc</a> 
</li>
<li><a name="Beta" class="target">Beta</a> 
</li>
<li><a name="BitC" class="target">BitC</a> 
</li>
<li><a name="Bondi" class="target">Bondi</a> 
</li>
<li><a name="Brainfuck" class="target">Brainfuck</a> 
</li>
<li><a name="C" class="target">C</a> 
</li>
<li><a name="C" class="target">C#</a> 
</li>
<li><a name="C" class="target">C++</a> 
</li>
<li><a name="COBOL" class="target">COBOL</a> 
</li>
<li><a name="Coq" class="target">Coq</a> &ndash; interactive proof assistant
<ul>
<li><a href="http://coq.inria.fr/">Main site</a>
</li>
<li><a href="../coq.html">My page on Coq</a>
</li>
</ul>

</li>
<li><a name="CPL" class="target">CPL</a> 
</li>
<li><a name="Cryptol" class="target">Cryptol</a> , by Galois
</li>
<li><a name="dc" class="target">dc</a> 
</li>
<li><a name="Dylan" class="target">Dylan</a> 
</li>
<li><a name="Erlang" class="target">Erlang</a> 
<ul>
<li><a href="http://www.erlang.org/">Main site</a>
</li>
<li><a href="http://code.google.com/p/distel/">Distle</a> &ndash; <a href="http://www.gnu.org/software/emacs/">Emacs</a> support for Erlang
<ul>
<li><a href="http://bc.tech.coop/blog/070528.html">A blog discussing Distle</a>
</li>
</ul>

</li>
<li>Erlang Tutorials
<ul>
<li><a href="http://erlang.org/course/course.html">An Erlang course from <i>Erlang University</i></a>
</li>
</ul>

</li>
<li>Web programming in Erlang
<ul>
<li><a href="http://nitrogenproject.com/">Nitrogen</a>
</li>
<li><a href="http://yaws.hyber.org/">Yaws</a>
</li>
<li><a href="http://erlyweb.org/">Erlyweb</a>
</li>
</ul>

</li>
<li>Books on Erlang
<ul>
<li><a href="http://www.amazon.com/Erlang-Web-Applications-Problem-Solutions/dp/0470743840/ref=sr_1_3?ie=UTF8&amp;s=books&amp;qid=1251268766&amp;sr=8-3">Erlang Web Applications</a>
</li>
</ul>

</li>
<li>Erlang Community
<ul>
<li><a href="http://www.trapexit.org/">Trapexit: The Erlang Community Site</a>
</li>
</ul>

</li>
</ul>

</li>
<li><a name="F" class="target">F#</a> 
</li>
<li><a name="Forth" class="target">Forth</a> 
</li>
<li><a name="Fortran" class="target">Fortran</a> 
</li>
<li><a name="Go" class="target">Go</a> (an experiment by Google)
</li>
<li><a name="Haskell" class="target">Haskell</a> 
</li>
<li><a name="Hecl" class="target">Hecl</a> &ndash; scripting languages for&hellip;
</li>
<li><a name="Intercal" class="target">Intercal</a> 
</li>
<li><a name="J" class="target">J</a> 
</li>
<li><a name="JCL" class="target">JCL</a> 
</li>
<li><a name="Java" class="target">Java</a> 
</li>
<li><a name="Javascript" class="target">Javascript</a> 
</li>
<li><a name="Jovial" class="target">Jovial</a> 
</li>
<li><a name="Juk" class="target">Juk</a> (ג'וק)
</li>
<li><a name="L6" class="target">L6</a> 
</li>
<li><a name="LaTeX" class="target">LaTeX</a> 
</li>
<li><a name="LISP" class="target">LISP</a> 
<ul>
<li>Dialects
<ul>
<li>Clojure
<ul>
<li><a href="http://www.clojure.org/">Homepage</a>
</li>
<li><a href="http://clojuredocs.org/">Clojure Documents</a>
</li>
<li><a href="http://java.ociweb.com/mark/clojure/article.html">Mark Volkman's tutorial</a>
</li>
<li><a href="http://www.4clojure.com/problems">Learning Clojure by solving simple problems</a>
</li>
</ul>

</li>
<li>Common LISP
</li>
<li>MacLISP
</li>
<li>Franz LISP
</li>
<li>Star LISP
</li>
<li>Interlisp
</li>
<li>XLISP
</li>
<li>T
</li>
<li>NIL
</li>
<li>Zetalisp
</li>
<li>elisp
</li>
</ul>

</li>
</ul>

</li>
<li><a name="Logo" class="target">Logo</a> 
<ul>
<li><a href="http://logo.twentygototen.org/">Logo in the website</a>
</li>
<li><a href="http://www.alancsmith.co.uk/">ACS Logo (for Mac/OSX)</a>
</li>
</ul>

</li>
<li><a name="LSL" class="target">LSL</a> 
</li>
<li><a name="M4" class="target">M4</a> 
</li>
<li><a name="Macsyma" class="target">Macsyma</a> 
</li>
<li><a name="Malbolge" class="target">Malbolge</a> 
</li>
<li><a name="Maple" class="target">Maple</a> 
</li>
<li><a name="Mathematica" class="target">Mathematica</a> 
</li>
<li><a name="Matlab" class="target">Matlab</a> 
</li>
<li><a name="Maude" class="target">Maude</a> 
</li>
<li><a name="Maxima" class="target">Maxima</a> 
</li>
<li><a name="Miranda" class="target">Miranda</a> 
</li>
<li><a href="./ml.html">ML</a>
</li>
<li><a name="Modula-2" class="target">Modula 2</a> 
</li>
<li><a name="Newspeak" class="target">Newspeak</a> 
</li>
<li><a name="Nu" class="target">Nu</a> 
</li>
<li><a name="Oberon" class="target">Oberon</a> 
</li>
<li><a name="Objective-C" class="target">Objective-C</a> 
</li>
<li><a name="Octave" class="target">Octave</a> 
</li>
<li><a name="PHP" class="target">PHP</a> 
</li>
<li><a name="PL-I" class="target">PL/I</a> 
</li>
<li><a name="Pascal" class="target">Pascal</a> 
</li>
<li><a name="Perl" class="target">Perl</a> 
</li>
<li><a name="Poplog" class="target">Poplog</a> 
</li>
<li><a name="Prolog" class="target">Prolog</a> 
<ul>
<li>Tutorials
</li>
<li>Books
</li>
<li>Implementations
<ul>
<li><a href="http://www.sics.se/isl/quintus/">Quintus Prolog</a>
</li>
<li><a href="http://www.sics.se/isl/sicstuswww/site/index.html">Sicstus Prolog</a>
</li>
<li><a href="http://www.swi-prolog.org/">SWI Prolog</a>
</li>
<li><a href="http://www.gprolog.org/">GNU Prolog</a>
</li>
<li><a href="http://www.visual-prolog.com/">Visual Prolog</a>
</li>
</ul>

</li>
<li>Prolog Community
<ul>
<li>
</li>
</ul>

</li>
</ul>

</li>
<li><a name="Python" class="target">Python</a> 
</li>
<li><a name="RATFOR" class="target">RATFOR</a> 
</li>
<li><a name="Reduce" class="target">Reduce</a> 
</li>
<li><a name="REXX" class="target">REXX</a> 
</li>
<li><a name="Ruby" class="target">Ruby</a> 
</li>
<li><a name="S-Lang" class="target">S-Lang</a> 
</li>
<li><a name="SAS" class="target">SAS</a> 
</li>
<li><a name="Scratch" class="target">Scratch</a> &ndash; 
<ul>
<li><a href="http://scratch.mit.edu/">Main Site</a>
</li>
<li><a href="http://www.scratch.org.il/">Israeli Site</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Scratch_(programming_language)">Wikipedia entry</a>
</li>
</ul>

</li>
<li><a name="SPSS" class="target">SPSS</a> 
</li>
<li><a name="SQL" class="target">SQL</a> 
</li>
<li><a name="Scala" class="target">Scala</a> 
</li>
<li><a href="./scheme.html">Scheme</a>
</li>
<li><a name="Self" class="target">Self</a> 
</li>
<li><a name="Simscript" class="target">Simscript</a> 
</li>
<li><a name="Simula" class="target">Simula</a> 
</li>
<li><a name="Smalltalk" class="target">Smalltalk</a> 
</li>
<li><a name="Snobol" class="target">Snobol</a> 
</li>
<li><a name="TCL" class="target">TCL</a> 
</li>
<li><a name="TeX" class="target">TeX</a> 
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-16 10:44:43 IDT</p>
<p class="author">Author: Mayer Goldberg</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
